export default function WhatsAppButton() {
  const phone = "525624671702";

  return (
    <a
      href={`https://wa.me/${phone}?text=Hola%20quiero%20información`}
      target="_blank"
      className="fixed bottom-6 right-6 z-50 group"
    >
      <div className="w-14 h-14 rounded-full bg-[#25D366] flex items-center justify-center shadow-lg animate-pulse">

        {/* ICONO WHATSAPP REAL */}
        <svg
          xmlns="http://www.w3.org/2000/svg"
          viewBox="0 0 32 32"
          className="w-7 h-7 fill-white"
        >
          <path d="M16 .396C7.164.396 0 7.56 0 16.396c0 2.893.757 5.72 2.197 8.21L0 32l7.56-2.168a15.944 15.944 0 008.44 2.36h.006c8.835 0 16-7.164 16-16S24.836.396 16 .396zm0 29.36c-2.51 0-4.97-.674-7.12-1.948l-.51-.302-4.49 1.288 1.3-4.37-.33-.53a13.38 13.38 0 01-2.05-7.2c0-7.39 6.01-13.4 13.4-13.4 3.58 0 6.94 1.395 9.47 3.93a13.3 13.3 0 013.93 9.47c-.01 7.39-6.02 13.4-13.41 13.4zm7.37-10.05c-.4-.2-2.36-1.17-2.72-1.3-.36-.13-.62-.2-.88.2s-1.02 1.3-1.25 1.56c-.23.26-.46.3-.86.1-.4-.2-1.7-.62-3.23-1.98-1.2-1.07-2.01-2.4-2.24-2.8-.23-.4-.02-.62.17-.82.18-.18.4-.46.6-.7.2-.23.26-.4.4-.66.13-.26.07-.5-.03-.7-.1-.2-.88-2.12-1.2-2.9-.32-.76-.64-.66-.88-.67l-.75-.01c-.26 0-.7.1-1.07.5s-1.4 1.37-1.4 3.35c0 1.98 1.44 3.9 1.64 4.17.2.26 2.84 4.34 6.9 6.08.97.42 1.73.67 2.32.86.98.3 1.87.26 2.58.16.79-.12 2.36-.96 2.7-1.88.33-.92.33-1.7.23-1.88-.1-.18-.36-.3-.76-.5z"/>
        </svg>

        {/* Glow */}
        <div className="absolute inset-0 rounded-full bg-[#25D366]/40 blur-xl opacity-0 group-hover:opacity-100 transition"></div>

      </div>
    </a>
  );
}